Enums/ЗадачиНачалаРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ЗадачиНачалаРаботы</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СписокНалоговОтчетов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НастройкаЗаполненияФормСтатистики</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СОтчетности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подключение1СЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьДоступКОрганизациям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьРеквизитыОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьБыстрыйСтарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьВидеоурок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьПараметрыУчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьУчетнаяПолитика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНачальныеОстатки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьНастройкаТорговыхТочек</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатитьЗадолженностьПоНалогамВзносам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УказатьДатуПрекращенияДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроверитьОсновнойВидДеятельности</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЗадачиБухгалтераКлиентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает код действующего правила подачи сведений о доходах и НДФЛ сотрудников при применении АУСН.
//
// Возвращаемое значение:
//   Строка - код правила
//
Функция КодПравилаНДФЛСведенияАУСН() Экспорт
	
	Возврат "2023_НДФЛ_СведенияАУСН";
	
КонецФункции

// Возвращает код действующего правила подачи сведений о доходах и НДФЛ сотрудников при применении АУСН
// за вторую половину месяца.
//
// Возвращаемое значение:
//   Строка - код правила
//
Функция КодПравилаНДФЛСведенияАУСНКонецМесяца() Экспорт
	
	Возврат "2023_НДФЛ_СведенияАУСН_КонецМесяца";
	
КонецФункции

// Возвращает код действующего правила подачи сведений о доходах и НДФЛ сотрудников при применении АУСН
// за вторую половину декабря.
//
// Возвращаемое значение:
//   Строка - код правила
//
Функция КодПравилаНДФЛСведенияАУСНКонецГода() Экспорт
	
	Возврат "2023_НДФЛ_СведенияАУСН_Декабрь";
	
КонецФункции

#КонецОбласти

Функция Идентификатор(Имя) Экспорт
	
	Цифры = "1234567890";
	НомерСтрокой = "";
	ДлинаИмени = СтрДлина(Имя);
	Для Индекс = 0 По ДлинаИмени - 1 Цикл
		Позиция = ДлинаИмени - Индекс;
		Символ = Сред(Имя,Позиция,1);
		Если СтрНайти(Цифры, Символ) = 0 Тогда
			Прервать;
		КонецЕсли;
		НомерСтрокой = Символ + НомерСтрокой;
	КонецЦикла;
	
	Если ПустаяСтрока(НомерСтрокой) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Число(НомерСтрокой) - 1;
	Исключение
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

Функция НомерКонтейнера(Индекс) Экспорт
	
	Возврат Формат(Индекс + 1, "ЧГ=0");
	
КонецФункции

Функция СсылкаНаИТС(Срок = Неопределено) Экспорт
	
	Если Срок = Неопределено Тогда
		Параметры = "";
	Иначе
		Параметры = "/?date=" + Формат(Срок, "ДФ=yyyyMMdd");
	КонецЕсли;
	
	Возврат "http://its.1c.ru/calendar" + Параметры;
	
КонецФункции

Функция ОписаниеДействия(ПараметрыКоманды) Экспорт
	
	Если ТипЗнч(ПараметрыКоманды.Правило) = Тип("ПеречислениеСсылка.ЗадачиНачалаРаботы") Тогда
		
		Если ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.СписокНалоговОтчетов") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       ВыполнениеЗадачБухгалтераВызовСервера.ИмяФормыНалогиОтчеты());
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ВводНачальныхОстатков") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       ВыполнениеЗадачБухгалтераВызовСервера.ИмяФормыВводНачальныхОстатков());
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СОтчетности") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СОтчетности", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.Подключение1СЭДО") Тогда
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("Подключение1СЭДО", Истина);
			ОписаниеДействия.Вставить("Организация", ПараметрыКоманды.Организация);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.НастройкаЗаполненияФормСтатистики") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "РегистрСведений.НастройкаЗаполненияФормСтатистики.Форма.НастройкаЗаполненияФормСтатистики");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ОплатитьЗадолженностьПоНалогамВзносам") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Обработка.ПомощникУплатыНалоговВзносовПрошлыхЛет.Форма.ФормаВводаНачальныхОстатковИнтеграцияСБанком");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.УказатьДатуПрекращенияДеятельности") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Ключ", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			
			ОписаниеДействия = Новый Структура;
			ОписаниеДействия.Вставить("ИмяФормы",       "Справочник.Организации.Форма.ФормаОрганизации");
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		ИначеЕсли ПараметрыКоманды.Правило = ПредопределенноеЗначение("Перечисление.ЗадачиНачалаРаботы.ПроверитьОсновнойВидДеятельности") Тогда
			
			ПараметрыФормы = Новый Структура;
			ПараметрыФормы.Вставить("Организация", ПараметрыКоманды.Организация);
			ПараметрыФормы.Вставить("ОткрытаИзСпискаЗадач", Истина);
			ПараметрыФормы.Вставить("ДатаНачала", НачалоГода(ДобавитьМесяц(ПараметрыКоманды.Срок, -12)));
			ПараметрыФормы.Вставить("ДатаОкончания", КонецГода(ПараметрыФормы.ДатаНачала));
			
			ОписаниеДействия = Новый Структура;
			ИмяФормы = "";
			ВыполнениеЗадачБухгалтераКлиентСерверПереопределяемый.ПриОпределенииИмениФормыПроверкиОсновногоВидаДеятельности(ИмяФормы);
			ОписаниеДействия.Вставить("ИмяФормы",       ИмяФормы);
			ОписаниеДействия.Вставить("ПараметрыФормы", ПараметрыФормы);
			
		Иначе
			
			Возврат Неопределено;
			
		КонецЕсли
		
	Иначе
		
		ОписаниеДействия = ВыполнениеЗадачБухгалтераВызовСервера.ОписаниеДействия(ПараметрыКоманды);
		
	КонецЕсли;
	
	Возврат ОписаниеДействия;
	
КонецФункции

Функция СрокПредупрежденияПриОграниченииСпособовОтправки() Экспорт
	
	Возврат 5; // 5 дней - достаточно дойти до учреждения или отправить почтой
	
КонецФункции

Функция ПредставлениеКомментария(СтатусУстановленВручную, Комментарий, ПользовательУстановившийСтатус) Экспорт
	
	Если Не СтатусУстановленВручную Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Комментарий) И ЗначениеЗаполнено(ПользовательУстановившийСтатус) Тогда
		Возврат СтрШаблон("%1 (%2)", Комментарий, ПользовательУстановившийСтатус);
	ИначеЕсли ЗначениеЗаполнено(Комментарий) Тогда
		Возврат Комментарий;
	ИначеЕсли ЗначениеЗаполнено(ПользовательУстановившийСтатус) Тогда
		Возврат СтрШаблон("Статус установлен вручную пользователем %1", ПользовательУстановившийСтатус);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Проверяет, является ли задача уплатой ИП/самозанятым добровольных взносов
// на социальное страхование по временной нетрудоспособности или с в связи с материнством.
//
// Параметры:
//   КодЗадачи - Строка - Код проверяемой задачи
//
// Возвращаемое значение:
//   Булево
//
Функция ЭтоУплатаДобровольныхВзносовИП(КодЗадачи) Экспорт
	
	КодыДобровольныеВзносы = Новый Массив;
	КодыДобровольныеВзносы.Добавить(КодЗадачиСтраховыеВзносыИП_ВНиМ());
	КодыДобровольныеВзносы.Добавить(КодЗадачиУплатаНаБольничныеСамозанятые());
	
	Возврат КодыДобровольныеВзносы.Найти(КодЗадачи) <> Неопределено;
	
КонецФункции

#Область КодыЗадач

Функция КодЗадачиНДС() Экспорт
	
	Возврат "НДС";
	
КонецФункции

Функция КодЗадачиУСН() Экспорт
	
	Возврат "УСН";
	
КонецФункции

Функция КодЗадачиАУСН() Экспорт
	
	Возврат "АУСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыАУСН() Экспорт
	
	Возврат "СтраховыеВзносыАУСН";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносы() Экспорт
	
	Возврат "СтраховыеВзносы";
	
КонецФункции

Функция КодПравилаОтчетаРасчетПоСтраховымВзносам() Экспорт
	Возврат "2023_ОтчетностьСтраховыеВзносы";
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП() Экспорт
	
	Возврат "СтраховыеВзносы_Предприниматель";
	
КонецФункции

Функция КодЗадачиНДФЛ() Экспорт
	
	Возврат "НДФЛ";
	
КонецФункции

Функция КодПравилаНДФЛКонецМесяца() Экспорт
	
	Возврат "2024_НДФЛ_Уведомление_КонецМесяца";
	
КонецФункции

Функция КодПравилаНДФЛКонецГода() Экспорт
	
	Возврат "2023_НДФЛ_Уведомление_Декабрь";
	
КонецФункции

Функция КодЗадачиНалогНаПрибыль() Экспорт
	
	Возврат "НалогНаПрибыль";
	
КонецФункции

Функция КодЗадачиНДФЛПоУплате() Экспорт
	
	Возврат "НДФЛ_Агент_Уплата";
	
КонецФункции

Функция КодЗадачиНДФЛПоОтчету() Экспорт
	
	Возврат "НДФЛ_Агент";
	
КонецФункции

Функция КодЗадачиНДФЛПоУведомлению() Экспорт
	
	Возврат "НДФЛ_Агент_Уведомление";
	
КонецФункции

Функция КодЗадачиНДФЛПредприниматель() Экспорт
	
	Возврат "НДФЛ_Предприниматель";
	
КонецФункции

Функция КодЗадачиСреднесписочнаяЧисленность() Экспорт
	
	Возврат "СведенияОСреднесписочнойЧисленности";
	
КонецФункции

Функция КодЗадачиСтатистика() Экспорт
	
	Возврат "СтатистическаяОтчетность";
	
КонецФункции

Функция КодЗадачиПатент() Экспорт
	
	Возврат "Патент";
	
КонецФункции

Функция КодЗадачиЕНВД() Экспорт
	
	Возврат "ЕНВД";
	
КонецФункции

Функция КодЗадачиТорговыйСбор() Экспорт
	
	Возврат "ТорговыйСбор";
	
КонецФункции

Функция КодЗадачиНалогНаПрофессиональныйДоход() Экспорт
	
	Возврат "НалогНаПрофессиональныйДоход";
	
КонецФункции

Функция КодЗадачиБухгалтерскаяОтчетность() Экспорт
	
	Возврат "БухгалтерскаяОтчетность";
	
КонецФункции

Функция КодЗадачиНалогНаИмущество() Экспорт
	
	Возврат "НалогНаИмущество";
	
КонецФункции

Функция КодЗадачиТранспортныйНалог() Экспорт
	
	Возврат "ТранспортныйНалог";
	
КонецФункции

Функция КодЗадачиЗемельныйНалог() Экспорт
	
	Возврат "ЗемельныйНалог";
	
КонецФункции

Функция КодЗадачиТуристическийНалог() Экспорт
	
	Возврат "ТуристическийНалог";
	
КонецФункции

Функция КодЗадачиСтраховыеВзносыИП_ВНиМ() Экспорт
	
	Возврат "2023_Уплата_ВНиМ";
	
КонецФункции

Функция КодЗадачиЕдиныйНалоговыйСчет() Экспорт
	
	Возврат "ЕдиныйНалоговыйСчет";
	
КонецФункции

Функция КодПравилаУведомленияЕдиныйНалоговыйСчет() Экспорт
	
	Возврат "2023_ЕНС_Уведомление";
	
КонецФункции

Функция ПолноеИмяПравилаСтраховыеВзносыИП_ВНиМ() Экспорт
	
	Возврат СтрШаблон("%1.%2", КодЗадачиСтраховыеВзносыИП(), КодЗадачиСтраховыеВзносыИП_ВНиМ());
	
КонецФункции

Функция КодЗадачиНДСТаможенногоСоюза() Экспорт
	
	Возврат "КосвенныеНалогиТамСоюз";
	
КонецФункции

Функция КодЗадачиЕНС() Экспорт
	
	Возврат "ЕдиныйНалоговыйСчет";
	
КонецФункции

Функция КодЗадачиНДФЛАгентУведомление() Экспорт
	
	Возврат "НДФЛ_Агент_Уведомление";
	
КонецФункции

Функция КодЗадачиВзносыИППриСнятииСУчета() Экспорт
	
	Возврат "2023_УплатаВзносов_СнятиеСУчета";
	
КонецФункции

Функция КодНалогаТребованиеФНС() Экспорт
	
	Возврат "ТребованиеФНС";
	
КонецФункции

// Возвращает код задачи для уплаты единого тарифа для ИН
//
// Возвращаемое значение:
//   Строка
//
Функция КодЗадачиЕдиныйТарифИП() Экспорт
	
	Возврат "2024_Уплата_ЕдиныйПомощник";
	
КонецФункции

Функция КодПравилаУплатаДопВзносы() Экспорт
	
	Возврат "2025_УплатаСтраховыеВзносы_ЛетныеЭкипажиИШахтеры";
	
КонецФункции

Функция КодЗадачиДокументСЭДО() Экспорт
	
	Возврат "ДокументСЭДО";
	
КонецФункции

Функция КодЗадачиЭкологическийСбор() Экспорт
	
	Возврат "ЭкологическийСбор";
	
КонецФункции

Функция КодЗадачиВодныйНалог() Экспорт
	
	Возврат "ВодныйНалог";
	
КонецФункции

Функция КодЗадачиНалогНаИгорныйБизнес() Экспорт
	
	Возврат "НалогНаИгорныйБизнес";
	
КонецФункции

Функция КодЗадачиЕдиныйСельхозНалог() Экспорт
	
	Возврат "ЕСХН";
	
КонецФункции

Функция КодЗадачиНалогПолезныеИскопаемые() Экспорт
	
	Возврат "НДПИ";
	
КонецФункции

Функция КодЗадачиЕдинаяУпрощеннаяДекларация() Экспорт
	
	Возврат "ЕдинаяУпрощеннаяДекларация";
	
КонецФункции

Функция КодЗадачиДекларированиеАлкогольнойПродукции() Экспорт
	
	Возврат "ДекларированиеАлкогольнойПродукции";
	
КонецФункции

Функция КодЗадачиПлатаЗаНегативноеВоздействиеНаОкружающуюСреду() Экспорт
	
	Возврат "ПлатаЗаНегативноеВоздействиеНаОкружающуюСреду";
	
КонецФункции

Функция КодЗадачиПрочаяОтчетностьРосприроднадзор() Экспорт
	
	Возврат "Росприроднадзор";
	
КонецФункции

Функция ИдентификаторПравилаСтраховыеВзносыДопВзносы() Экспорт
	
	Возврат "2013_Отчет_Допвзносы_Накопительная_ПФР";
	
КонецФункции

Функция КодЗадачиУплатаНаБольничныеСамозанятые() Экспорт
	
	Возврат "2026_УплатаНаБольничныеСамозанятые";
	
КонецФункции

Функция КодЗадачиУплатаПенсионныеДобровольныеВзносы() Экспорт
	
	Возврат "2026_УплатаПенсионныеДобровольныеВзносы";
	
КонецФункции

Функция КодЗадачиДекларацияОрганизацияУтраченоПравоНаУСН() Экспорт
	
	Возврат "2026_ДекларацияОрганизация_УтраченоПравоНаУСН";
	
КонецФункции

Функция КодЗадачиУплатаОрганизацияУтраченоПравоНаУСН() Экспорт
	
	Возврат "2026_УплатаОрганизация_УтраченоПравоНаУСН";
	
КонецФункции

#КонецОбласти
